Revit 2026 API

# UIApplicationCanPostCommand Method

---

Identifies if the given command can be posted, using PostCommand(RevitCommandId).

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanPostCommand(
	RevitCommandId commandId
)
```
```vb
Public Function CanPostCommand (
	commandId As RevitCommandId
) As Boolean
```
```cpp
public:
bool CanPostCommand(
	RevitCommandId^ commandId
)
```
```fsharp
member CanPostCommand :
        commandId : RevitCommandId -> bool
```

#### Parameters

commandId RevitCommandId
     The command Id.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when commandId is . |

Only members of Autodesk.Revit.UI.PostableCommand or external commands can be posted.

#### Reference

UIApplication Class

Autodesk.Revit.UI Namespace